     A          R ART_PRICE
     A                                  1  2HTML('QPUIREC0    ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"art_price"},"items":[]}')
